# St7GetDynamicRestartFile

Returns the name of the dynamic restart file.

long St7GetDynamicRestartFile(long uID, char* FileName, long MaxStringLen)
Input Parameters
uID
Strand7 model file ID.
MaxStringLen
Maximum number of characters allocated for FileName.
Output Parameters
FileName
Full path and name for the dynamic restart file.